ConnorRigby/150g-battlebot/firmware/pcbot/pcbot.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32G4
ProjectManager.MainLocation=Core/Src
PB13.GPIOParameters=GPIO_Label
PA6.Mode=Full_Duplex_Master
SH.S_TIM4_CH2.ConfNb=1
RCC.USART1Freq_Value=16000000
SH.S_TIM1_CH4.0=TIM1_CH4,PWM Generation4 CH4
RCC.SAI1Freq_Value=16000000
RCC.CortexFreq_Value=16000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32G431C6Ux
SPI1.VirtualType=VM_MASTER
PB10.Mode=Asynchronous
TIM1.IPParameters=Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4
PC10.Locked=true
PC10.Signal=GPIO_Output
PB14.GPIO_Label=M3_PWM
PA0.GPIO_Label=M2_ENCA
PA12.GPIOParameters=GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_SPI1_Init-SPI1-false-HAL-true,4-MX_TIM1_Init-TIM1-false-HAL-true,5-MX_TIM2_Init-TIM2-false-HAL-true,6-MX_TIM3_Init-TIM3-false-HAL-true,7-MX_TIM4_Init-TIM4-false-HAL-true,8-MX_TIM8_Init-TIM8-false-HAL-true,9-MX_TIM15_Init-TIM15-false-HAL-true,10-MX_USART3_UART_Init-USART3-false-HAL-true
PA9.GPIOParameters=GPIO_Label
PA11.GPIOParameters=GPIO_Label
PC6.GPIO_Label=REF
PG10-NRST.GPIO_Label=RESET
PA3.GPIOParameters=GPIO_Label
PB0.GPIO_Label=RF_INT
PB6.GPIO_Label=M4_ENCA
RCC.USART2Freq_Value=16000000
SH.S_TIM1_CH3.ConfNb=1
SH.S_TIM1_CH1.ConfNb=1
PC13.GPIO_Label=FAULT
PB13.GPIO_Label=M1_DIR
PB11.Signal=USART3_RX
PB13.Signal=GPIO_Output
PB15.Signal=S_TIM15_CH2
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=16000000
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_Label
SH.S_TIM15_CH2.0=TIM15_CH2,PWM Generation2 CH2
USART3.VirtualMode-Asynchronous=VM_ASYNC
RCC.LPTIM1Freq_Value=16000000
RCC.I2C3Freq_Value=16000000
Mcu.IP4=TIM1
RCC.FCLKCortexFreq_Value=16000000
Mcu.IP5=TIM2
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=SPI1
Mcu.IP3=SYS
PB4.GPIOParameters=GPIO_Label
Mcu.IP0=NVIC
Mcu.IP1=RCC
PA12.Signal=S_TIM4_CH2
SH.GPXTI3.ConfNb=1
Mcu.UserConstants=
SH.S_TIM3_CH2.ConfNb=1
Mcu.ThirdPartyNb=0
TIM1.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=16000000
TIM8.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
Mcu.IPNb=11
TIM2.IPParameters=Channel-PWM Generation3 CH3
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=16000000
PB6.Signal=S_TIM4_CH1
SPI1.CalculateBaudRate=8.0 MBits/s
PA8.GPIOParameters=GPIO_Label
Mcu.Pin6=PA0
Mcu.Pin7=PA1
Mcu.Pin8=PA2
Mcu.Pin9=PA3
RCC.AHBFreq_Value=16000000
PB13.Locked=true
Mcu.Pin0=PC13
Mcu.Pin1=PC14-OSC32_IN
TIM8.IPParameters=Channel-PWM Generation3 CH3,Channel-PWM Generation1 CH1
GPIO.groupedBy=
Mcu.Pin2=PC15-OSC32_OUT
Mcu.Pin3=PF0-OSC_IN
RCC.USART3Freq_Value=16000000
Mcu.Pin4=PF1-OSC_OUT
Mcu.Pin5=PG10-NRST
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
TIM4.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB3.Mode=JTAG_4_pins
PA4.Locked=true
Mcu.IP10=USART3
PA15.Mode=JTAG_4_pins
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PB12.GPIO_Label=M2_DIR
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.3.0
MxDb.Version=DB.6.0.10
PB0.GPIOParameters=GPIO_Label
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
PC14-OSC32_IN.Mode=LSE-External-Oscillator
RCC.VCOInputFreq_Value=16000000
PC4.GPIO_Label=RF_CS
TIM15.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PA14.Mode=JTAG_4_pins
PC11.GPIO_Label=M4_DIR
File.Version=6
PA10.GPIO_Label=M2_PWM
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
SH.S_TIM4_CH2.0=TIM4_CH2,Encoder_Interface
SH.S_TIM2_CH1.ConfNb=1
PB7.Signal=SharedAnalog_PB7
PA8.Signal=S_TIM1_CH1
RCC.PLLRCLKFreq_Value=64000000
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.S_TIM3_CH1.0=TIM3_CH1,Encoder_Interface
PB6.GPIOParameters=GPIO_Label
ProjectManager.HalAssertFull=false
SH.S_TIM8_CH1.ConfNb=1
PB0.Locked=true
RCC.CRSFreq_Value=48000000
ProjectManager.ProjectName=pcbot
PA0.Signal=S_TIM2_CH1
SH.S_TIM8_CH3.ConfNb=1
PB7.GPIO_Label=BAT_SENSE
Mcu.Package=UFQFPN48
PB9.Signal=S_TIM8_CH3
PA6.Signal=SPI1_MISO
TIM8.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
PA7.Locked=true
PA5.Locked=true
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=IMU_INT1
RCC.LSI_VALUE=32000
SH.GPXTI0.0=GPIO_EXTI0
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.LSCOPinFreq_Value=32000
USART3.IPParameters=VirtualMode-Asynchronous
PA10.Signal=S_TIM1_CH3
PA15.Signal=SYS_JTDI
PB14.GPIOParameters=GPIO_Label
PB5.GPIO_Label=M3_ENCB
RCC.PLLPoutputFreq_Value=64000000
SH.S_TIM4_CH1.0=TIM4_CH1,Encoder_Interface
RCC.APB1TimFreq_Value=16000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC4.Locked=true
RCC.LPUART1Freq_Value=16000000
PB10.GPIOParameters=GPIO_Label
PF1-OSC_OUT.Mode=HSE-External-Oscillator
TIM4.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
PA4.GPIO_Label=IMU_CS
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
PF1-OSC_OUT.Signal=RCC_OSC_OUT
RCC.HSI48_VALUE=48000000
PB4.Signal=S_TIM3_CH1
TIM15.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
PA3.Signal=GPXTI3
SH.SharedAnalog_PB7.0=GPIO_Analog
PA5.Mode=Full_Duplex_Master
SH.SharedAnalog_PB7.1=SYS_PVD_IN,Mode_PVD_Ext
SH.S_TIM8_CH3.0=TIM8_CH3,PWM Generation3 CH3
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
SH.S_TIM4_CH1.ConfNb=1
RCC.I2SFreq_Value=16000000
RCC.PLLQoutputFreq_Value=64000000
ProjectManager.ProjectFileName=pcbot.ioc
SH.S_TIM2_CH1.0=TIM2_CH1,Encoder_Interface
PA7.Mode=Full_Duplex_Master
PC10.GPIO_Label=M3_DIR
Mcu.PinsNb=42
ProjectManager.NoMain=false
PC11.Locked=true
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
PC13.Locked=true
PA9.GPIO_Label=M1_ENCB
PC13.Signal=GPIO_Input
PC11.Signal=GPIO_Output
PC4.Signal=GPIO_Output
PC6.Signal=S_TIM8_CH1
PB11.GPIO_Label=VCP_RX
SH.GPXTI0.ConfNb=1
PA11.GPIO_Label=M1_PWM
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
SH.SharedAnalog_PB7.ConfNb=2
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB10.Locked=true
PC14-OSC32_IN.Signal=RCC_OSC32_IN
PC11.GPIOParameters=GPIO_Label
PA12.GPIO_Label=M4_ENCB
RCC.FamilyName=M
PB8-BOOT0.Locked=true
PA13.Signal=SYS_JTMS-SWDIO
SH.S_TIM2_CH2.0=TIM2_CH2,Encoder_Interface
PA8.GPIO_Label=M1_ENCA
SH.S_TIM1_CH1.0=TIM1_CH1,Encoder_Interface
PG10-NRST.Locked=true
PB11.Mode=Asynchronous
PG10-NRST.Signal=GPIO_Output
ProjectManager.TargetToolchain=Makefile
TIM4.IPParameters=Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4
PB10.GPIO_Label=VCP_TX
PB7.GPIOParameters=GPIO_Label
PA9.Signal=S_TIM1_CH2
SH.S_TIM2_CH2.ConfNb=1
PB11.GPIOParameters=GPIO_Label
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=64000000
TIM15.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PA1.Signal=S_TIM2_CH2
PF0-OSC_IN.Mode=HSE-External-Oscillator
SH.S_TIM1_CH2.ConfNb=1
PB10.Signal=USART3_TX
PB14.Signal=S_TIM15_CH1
PA5.Signal=SPI1_SCK
Mcu.Pin40=VP_SYS_VS_Systick
SH.S_TIM3_CH2.0=TIM3_CH2,Encoder_Interface
Mcu.Pin41=VP_SYS_VS_DBSignals
SH.S_TIM8_CH1.0=TIM8_CH1,PWM Generation1 CH1
PB8-BOOT0.Signal=GPIO_Input
board=custom
SH.GPXTI3.0=GPIO_EXTI3
RCC.VCOOutputFreq_Value=128000000
ProjectManager.LastFirmware=true
SH.S_TIM15_CH1.0=TIM15_CH1,PWM Generation1 CH1
SH.S_TIM15_CH1.ConfNb=1
SH.S_TIM15_CH2.ConfNb=1
RCC.APB2Freq_Value=16000000
RCC.UART4Freq_Value=16000000
MxCube.Version=6.1.2
PB4.GPIO_Label=M3_ENCA
Mcu.Pin37=PB7
Mcu.Pin38=PB8-BOOT0
PB15.GPIO_Label=M4_PWM
SH.S_TIM1_CH2.0=TIM1_CH2,Encoder_Interface
Mcu.Pin35=PB5
RCC.I2C1Freq_Value=16000000
Mcu.Pin36=PB6
SPI1.Mode=SPI_MODE_MASTER
PC13.GPIOParameters=GPIO_Label
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
RCC.FDCANFreq_Value=16000000
Mcu.Pin39=PB9
RCC.RNGFreq_Value=64000000
Mcu.Pin30=PA15
PA1.GPIO_Label=M2_ENCB
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
TIM2.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
Mcu.Pin33=PB3
Mcu.Pin34=PB4
Mcu.Pin31=PC10
Mcu.Pin32=PC11
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
PC10.GPIOParameters=GPIO_Label
PB15.GPIOParameters=GPIO_Label
PA13.Mode=JTAG_4_pins
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSI_VALUE,MCO1PinFreq_Value,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,UART4Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32G431C(6-8-B)Ux
Mcu.Pin26=PA11
Mcu.Pin27=PA12
PA2.Signal=SYS_WKUP4
Mcu.Pin24=PA9
ProjectManager.UnderRoot=false
Mcu.Pin25=PA10
Mcu.IP8=TIM8
Mcu.IP9=TIM15
Mcu.Pin28=PA13
Mcu.IP6=TIM3
Mcu.Pin29=PA14
Mcu.IP7=TIM4
ProjectManager.CoupleFile=false
PB4.Locked=true
PB3.Signal=SYS_JTDO-SWO
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=16000000
Mcu.Pin22=PC6
PB5.Signal=S_TIM3_CH2
Mcu.Pin23=PA8
Mcu.Pin20=PB14
PA3.Locked=true
Mcu.Pin21=PB15
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
PA11.Signal=S_TIM1_CH4
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=PB0
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB10
Mcu.Pin13=PA7
Mcu.Pin14=PC4
PC6.GPIOParameters=GPIO_Label
SH.S_TIM1_CH3.0=TIM1_CH3,PWM Generation3 CH3
Mcu.Pin19=PB13
SH.S_TIM3_CH1.ConfNb=1
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB11
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB12
PG10-NRST.GPIOParameters=GPIO_Label
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA5
Mcu.Pin12=PA6
Mcu.Pin10=PA4
PB7.Locked=true
PA2.Mode=SYS_WakeUp3
RCC.PWRFreq_Value=16000000
PF0-OSC_IN.Signal=RCC_OSC_IN
TIM1.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
RCC.I2C2Freq_Value=16000000
RCC.APB1Freq_Value=16000000
PB0.Signal=GPXTI0
SH.S_TIM1_CH4.ConfNb=1
PB11.Locked=true
ProjectManager.DeviceId=STM32G431C6Ux
PB12.GPIOParameters=GPIO_Label
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=0
PA3.GPIO_Label=IMU_INT2
PA7.Signal=SPI1_MOSI
PA6.Locked=true
